# NewBoundingBoxUV Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewBoundingBoxUV Method
Application Class See Also
---
Creates an empty two-dimensional rectangle.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public BoundingBoxUV NewBoundingBoxUV()
```

Visual Basic
---
```text
Public Function NewBoundingBoxUV As BoundingBoxUV
```

Visual C++
---
```text
public:
BoundingBoxUV^ NewBoundingBoxUV()
```

# See Also
Application Class
NewBoundingBoxUV Overload
Autodesk.Revit.Creation Namespace